; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { [11 x i32]*, %struct.lpm_v4_key*, i32*, [1 x i32]*, [10000 x i32]* }
%struct.lpm_v4_key = type { i32, i32 }
%struct.anon.0 = type { [2 x i32]*, i32*, %struct.data_value*, [1 x i32]* }
%struct.data_value = type { i32, i32, i32, i32 }
%struct.anon.1 = type { [1 x i32]*, i32*, %struct.logger_value*, [100000 x i32]* }
%struct.logger_value = type { i32, i32, %struct.fixed_point }
%struct.fixed_point = type { i32, i32 }
%struct.anon.2 = type { [2 x i32]*, i32*, %struct.loc_ts*, [1 x i32]* }
%struct.loc_ts = type { %struct.bpf_spin_lock, i64 }
%struct.bpf_spin_lock = type { i32 }
%struct.anon.4 = type { [14 x i32]*, i32*, i32*, [1 x i32]* }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.bpf_map = type opaque
%struct.bpf_map.3 = type opaque

@__const.xdp_filter_func.error_log = private unnamed_addr constant [29 x i8] c"Issue with packet size, ETH\0A\00", align 1
@__const.xdp_filter_func.error_log.1 = private unnamed_addr constant [30 x i8] c"Issue with packet size, IPv4\0A\00", align 1
@blacklist = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !0
@__const.xdp_filter_func.error_log.2 = private unnamed_addr constant [25 x i8] c"IP listed on blocklist.\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "blacklist", scope: !2, file: !3, line: 65, type: !238, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !20, globals: !38, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/nii2/ebpf_pfilt/kex/main", checksumkind: CSK_MD5, checksum: "d245a541c10371275efbffbfb0e9a4dd")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 5436, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "3810ac036d82ed3898d498c10e871015")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1168, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "BPF_ANY", value: 0)
!17 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!18 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!19 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!20 = !{!21, !22, !23, !26, !27, !28, !33, !37}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !24, line: 24, baseType: !25)
!24 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !29, line: 26, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !31, line: 41, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int64_t", file: !34, line: 161, baseType: !35)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !31, line: 48, baseType: !36)
!36 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!38 = !{!39, !45, !0, !74, !93, !112, !124, !126, !128, !185, !187, !194, !201, !208, !213, !219, !221, !226, !228, !233}
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 332, type: !41, isLocal: false, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 32, elements: !43)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !{!44}
!44 = !DISubrange(count: 4)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "logger", scope: !2, file: !3, line: 56, type: !47, isLocal: false, isDefinition: true)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 50, size: 256, elements: !48)
!48 = !{!49, !54, !57, !69}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !47, file: !3, line: 52, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 1)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !47, file: !3, line: 53, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !24, line: 27, baseType: !7)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !47, file: !3, line: 54, baseType: !58, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "logger_value", file: !3, line: 30, size: 128, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !3, line: 32, baseType: !28, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !59, file: !3, line: 33, baseType: !28, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !59, file: !3, line: 34, baseType: !64, size: 64, offset: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_point", file: !65, line: 155, size: 64, elements: !66)
!65 = !DIFile(filename: "./fixed-point.h", directory: "/home/nii2/ebpf_pfilt/kex/main", checksumkind: CSK_MD5, checksum: "86a1e70feabf3d9f20ceafccd1b1b258")
!66 = !{!67, !68}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !64, file: !65, line: 157, baseType: !28, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !64, file: !65, line: 158, baseType: !28, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !47, file: !3, line: 55, baseType: !70, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 3200000, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 100000)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "data", scope: !2, file: !3, line: 73, type: !76, isLocal: false, isDefinition: true)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 67, size: 256, elements: !77)
!77 = !{!78, !83, !84, !92}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !3, line: 69, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 2)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !76, file: !3, line: 70, baseType: !55, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !76, file: !3, line: 71, baseType: !85, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "data_value", file: !3, line: 37, size: 128, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev_interval_pkt", scope: !86, file: !3, line: 39, baseType: !28, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cur_interval_pkt", scope: !86, file: !3, line: 40, baseType: !28, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !86, file: !3, line: 41, baseType: !28, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "int_bits", scope: !86, file: !3, line: 42, baseType: !28, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !76, file: !3, line: 72, baseType: !50, size: 64, offset: 192)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "loc_ts", scope: !2, file: !3, line: 81, type: !95, isLocal: false, isDefinition: true)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 75, size: 256, elements: !96)
!96 = !{!97, !98, !99, !111}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !3, line: 77, baseType: !79, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !95, file: !3, line: 78, baseType: !55, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !95, file: !3, line: 79, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loc_ts", file: !3, line: 44, size: 128, elements: !102)
!102 = !{!103, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !101, file: !3, line: 46, baseType: !104, size: 32)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_spin_lock", file: !6, line: 6186, size: 32, elements: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !104, file: !6, line: 6187, baseType: !56, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !101, file: !3, line: 47, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !29, line: 27, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !31, line: 47, baseType: !110)
!110 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !95, file: !3, line: 80, baseType: !50, size: 64, offset: 192)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 88, type: !114, isLocal: false, isDefinition: true)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 83, size: 256, elements: !115)
!115 = !{!116, !121, !122, !123}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !3, line: 84, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 448, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 14)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !114, file: !3, line: 85, baseType: !55, size: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !114, file: !3, line: 86, baseType: !55, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !114, file: !3, line: 87, baseType: !50, size: 64, offset: 192)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "entropy_all", scope: !2, file: !3, line: 91, type: !64, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "avg", scope: !2, file: !3, line: 92, type: !64, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "stdin", scope: !2, file: !130, line: 143, type: !131, isLocal: false, isDefinition: false)
!130 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !133, line: 7, baseType: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !135, line: 49, size: 1728, elements: !136)
!135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!136 = !{!137, !138, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !153, !155, !156, !157, !159, !160, !162, !164, !167, !169, !172, !175, !176, !177, !180, !181}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !134, file: !135, line: 51, baseType: !32, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !134, file: !135, line: 54, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !134, file: !135, line: 55, baseType: !139, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !134, file: !135, line: 56, baseType: !139, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !134, file: !135, line: 57, baseType: !139, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !134, file: !135, line: 58, baseType: !139, size: 64, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !134, file: !135, line: 59, baseType: !139, size: 64, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !134, file: !135, line: 60, baseType: !139, size: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !134, file: !135, line: 61, baseType: !139, size: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !134, file: !135, line: 64, baseType: !139, size: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !134, file: !135, line: 65, baseType: !139, size: 64, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !134, file: !135, line: 66, baseType: !139, size: 64, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !134, file: !135, line: 68, baseType: !151, size: 64, offset: 768)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !135, line: 36, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !134, file: !135, line: 70, baseType: !154, size: 64, offset: 832)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !134, file: !135, line: 72, baseType: !32, size: 32, offset: 896)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !134, file: !135, line: 73, baseType: !32, size: 32, offset: 928)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !134, file: !135, line: 74, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 152, baseType: !22)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !134, file: !135, line: 77, baseType: !25, size: 16, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !134, file: !135, line: 78, baseType: !161, size: 8, offset: 1040)
!161 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !134, file: !135, line: 79, baseType: !163, size: 8, offset: 1048)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 8, elements: !52)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !134, file: !135, line: 81, baseType: !165, size: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !135, line: 43, baseType: null)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !134, file: !135, line: 89, baseType: !168, size: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 153, baseType: !109)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !134, file: !135, line: 91, baseType: !170, size: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !135, line: 37, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !134, file: !135, line: 92, baseType: !173, size: 64, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !135, line: 38, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !134, file: !135, line: 93, baseType: !154, size: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !134, file: !135, line: 94, baseType: !21, size: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !134, file: !135, line: 95, baseType: !178, size: 64, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !179, line: 46, baseType: !26)
!179 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !134, file: !135, line: 96, baseType: !32, size: 32, offset: 1536)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !134, file: !135, line: 98, baseType: !182, size: 160, offset: 1568)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 20)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "stdout", scope: !2, file: !130, line: 144, type: !131, isLocal: false, isDefinition: false)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !189, line: 114, type: !190, isLocal: true, isDefinition: true)
!189 = !DIFile(filename: "./../lib/libbpf/src/bpf_helper_defs.h", directory: "/home/nii2/ebpf_pfilt/kex/main", checksumkind: CSK_MD5, checksum: "7422ca06c9dc86eba2f268a57d8acf2f")
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !24, line: 31, baseType: !36)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !189, line: 177, type: !196, isLocal: true, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!22, !199, !56, null}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !189, line: 56, type: !203, isLocal: true, isDefinition: true)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!21, !21, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !189, line: 78, type: !210, isLocal: true, isDefinition: true)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!22, !21, !206, !206, !193}
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "bpf_spin_lock", scope: !2, file: !189, line: 2404, type: !215, isLocal: true, isDefinition: true)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!22, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "bpf_spin_unlock", scope: !2, file: !189, line: 2415, type: !215, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "bpf_for_each_map_elem", scope: !2, file: !189, line: 3909, type: !223, isLocal: true, isDefinition: true)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!22, !21, !21, !21, !193}
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "count", scope: !2, file: !3, line: 90, type: !32, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !189, line: 88, type: !230, isLocal: true, isDefinition: true)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!22, !21, !206}
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !189, line: 1323, type: !235, isLocal: true, isDefinition: true)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!22, !21, !193, !193}
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 58, size: 320, elements: !239)
!239 = !{!240, !245, !251, !252, !253}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !3, line: 60, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 352, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 11)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !238, file: !3, line: 61, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpm_v4_key", file: !3, line: 24, size: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "prefixlen", scope: !247, file: !3, line: 26, baseType: !56, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !247, file: !3, line: 27, baseType: !56, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !238, file: !3, line: 62, baseType: !55, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !238, file: !3, line: 63, baseType: !50, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !238, file: !3, line: 64, baseType: !254, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 320000, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 10000)
!258 = !{i32 7, !"Dwarf Version", i32 5}
!259 = !{i32 2, !"Debug Info Version", i32 3}
!260 = !{i32 1, !"wchar_size", i32 4}
!261 = !{i32 7, !"frame-pointer", i32 2}
!262 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!263 = distinct !DISubprogram(name: "xdp_filter_func", scope: !3, file: !3, line: 189, type: !264, scopeLine: 190, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !275)
!264 = !DISubroutineType(types: !265)
!265 = !{!32, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5447, size: 192, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !267, file: !6, line: 5448, baseType: !56, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !267, file: !6, line: 5449, baseType: !56, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !267, file: !6, line: 5450, baseType: !56, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !267, file: !6, line: 5452, baseType: !56, size: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !267, file: !6, line: 5453, baseType: !56, size: 32, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !267, file: !6, line: 5455, baseType: !56, size: 32, offset: 160)
!275 = !{!276, !277, !278, !291, !314, !315, !321, !329, !330, !336, !337, !338, !344, !345, !348, !349, !352, !355, !356, !357}
!276 = !DILocalVariable(name: "ctx", arg: 1, scope: !263, file: !3, line: 189, type: !266)
!277 = !DILocalVariable(name: "ts", scope: !263, file: !3, line: 191, type: !108)
!278 = !DILocalVariable(name: "eth", scope: !263, file: !3, line: 192, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !281, line: 168, size: 112, elements: !282)
!281 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!282 = !{!283, !287, !288}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !280, file: !281, line: 169, baseType: !284, size: 48)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 48, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 6)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !280, file: !281, line: 170, baseType: !284, size: 48, offset: 48)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !280, file: !281, line: 171, baseType: !289, size: 16, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !290, line: 25, baseType: !23)
!290 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!291 = !DILocalVariable(name: "ip", scope: !263, file: !3, line: 193, type: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !294, line: 44, size: 160, elements: !295)
!294 = !DIFile(filename: "/usr/include/netinet/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "777a3c26c651c3cea644451d8391a76c")
!295 = !{!296, !297, !298, !302, !305, !306, !307, !308, !309, !310, !313}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !293, file: !294, line: 47, baseType: !7, size: 4, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !293, file: !294, line: 48, baseType: !7, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !293, file: !294, line: 55, baseType: !299, size: 8, offset: 8)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !300, line: 24, baseType: !301)
!300 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !31, line: 38, baseType: !27)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !293, file: !294, line: 56, baseType: !303, size: 16, offset: 16)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !300, line: 25, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !31, line: 40, baseType: !25)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !293, file: !294, line: 57, baseType: !303, size: 16, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !293, file: !294, line: 58, baseType: !303, size: 16, offset: 48)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !293, file: !294, line: 59, baseType: !299, size: 8, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !293, file: !294, line: 60, baseType: !299, size: 8, offset: 72)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !293, file: !294, line: 61, baseType: !303, size: 16, offset: 80)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !293, file: !294, line: 62, baseType: !311, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !300, line: 26, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !31, line: 42, baseType: !7)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !293, file: !294, line: 63, baseType: !311, size: 32, offset: 128)
!314 = !DILocalVariable(name: "filter_key", scope: !263, file: !3, line: 194, type: !247)
!315 = !DILocalVariable(name: "error_log", scope: !316, file: !3, line: 202, type: !318)
!316 = distinct !DILexicalBlock(scope: !317, file: !3, line: 201, column: 9)
!317 = distinct !DILexicalBlock(scope: !263, file: !3, line: 200, column: 13)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 232, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 29)
!321 = !DILocalVariable(name: "error_log", scope: !322, file: !3, line: 215, type: !326)
!322 = distinct !DILexicalBlock(scope: !323, file: !3, line: 214, column: 17)
!323 = distinct !DILexicalBlock(scope: !324, file: !3, line: 213, column: 21)
!324 = distinct !DILexicalBlock(scope: !325, file: !3, line: 209, column: 9)
!325 = distinct !DILexicalBlock(scope: !263, file: !3, line: 208, column: 13)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 240, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 30)
!329 = !DILocalVariable(name: "rule", scope: !324, file: !3, line: 229, type: !55)
!330 = !DILocalVariable(name: "error_log", scope: !331, file: !3, line: 232, type: !333)
!331 = distinct !DILexicalBlock(scope: !332, file: !3, line: 231, column: 17)
!332 = distinct !DILexicalBlock(scope: !324, file: !3, line: 230, column: 21)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 200, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 25)
!336 = !DILocalVariable(name: "key", scope: !324, file: !3, line: 238, type: !32)
!337 = !DILocalVariable(name: "tmp", scope: !324, file: !3, line: 239, type: !85)
!338 = !DILocalVariable(name: "error_log", scope: !339, file: !3, line: 252, type: !341)
!339 = distinct !DILexicalBlock(scope: !340, file: !3, line: 251, column: 17)
!340 = distinct !DILexicalBlock(scope: !324, file: !3, line: 240, column: 21)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 304, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 38)
!344 = !DILocalVariable(name: "value", scope: !324, file: !3, line: 258, type: !58)
!345 = !DILocalVariable(name: "new_value", scope: !346, file: !3, line: 268, type: !59)
!346 = distinct !DILexicalBlock(scope: !347, file: !3, line: 266, column: 17)
!347 = distinct !DILexicalBlock(scope: !324, file: !3, line: 259, column: 21)
!348 = !DILocalVariable(name: "lts", scope: !324, file: !3, line: 276, type: !100)
!349 = !DILocalVariable(name: "error_log", scope: !350, file: !3, line: 279, type: !318)
!350 = distinct !DILexicalBlock(scope: !351, file: !3, line: 278, column: 17)
!351 = distinct !DILexicalBlock(scope: !324, file: !3, line: 277, column: 21)
!352 = !DILocalVariable(name: "t", scope: !353, file: !3, line: 304, type: !86)
!353 = distinct !DILexicalBlock(scope: !354, file: !3, line: 285, column: 17)
!354 = distinct !DILexicalBlock(scope: !324, file: !3, line: 284, column: 21)
!355 = !DILocalVariable(name: "d", scope: !353, file: !3, line: 305, type: !85)
!356 = !DILocalVariable(name: "cnt", scope: !353, file: !3, line: 307, type: !64)
!357 = !DILabel(scope: !263, name: "END", file: !3, line: 328)
!358 = !DILocation(line: 0, scope: !263)
!359 = !DILocation(line: 191, column: 22, scope: !263)
!360 = !DILocation(line: 194, column: 9, scope: !263)
!361 = !DILocation(line: 194, column: 27, scope: !263)
!362 = !DILocation(line: 195, column: 20, scope: !263)
!363 = !DILocation(line: 195, column: 30, scope: !263)
!364 = !{!365, !366, i64 0}
!365 = !{!"lpm_v4_key", !366, i64 0, !366, i64 4}
!366 = !{!"int", !367, i64 0}
!367 = !{!"omnipotent char", !368, i64 0}
!368 = !{!"Simple C/C++ TBAA"}
!369 = !DILocation(line: 198, column: 34, scope: !263)
!370 = !{!371, !366, i64 0}
!371 = !{!"xdp_md", !366, i64 0, !366, i64 4, !366, i64 8, !366, i64 12, !366, i64 16, !366, i64 20}
!372 = !DILocation(line: 198, column: 23, scope: !263)
